Repository: thaitop/thaitop-register-form
Catalog: languages/thaitop-register-form-*.po
Languages: th

source: Please fill in all required fields
th: กรุณากรอกข้อมูลที่จำเป็นให้ครบถ้วน

source: This username is already taken
th: ชื่อผู้ใช้นี้ถูกใช้งานแล้ว

source: This email is already registered
th: อีเมลนี้ถูกลงทะเบียนแล้ว

source: Please verify that you are not a robot
th: กรุณายืนยันว่าคุณไม่ใช่โปรแกรมอัตโนมัติ

source: Registration validation failed
th: การตรวจสอบการลงทะเบียนล้มเหลว

source: Error creating user account
th: เกิดข้อผิดพลาดในการสร้างบัญชีผู้ใช้

source: Custom field data saved successfully
th: บันทึกข้อมูลฟิลด์กำหนดเองสำเร็จ

source: Error saving custom field data
th: เกิดข้อผิดพลาดในการบันทึกข้อมูลฟิลด์กำหนดเอง

source: Register Form Settings
th: ตั้งค่าแบบฟอร์มลงทะเบียน

source: Register Form
th: แบบฟอร์มลงทะเบียน

source: Custom Fields
th: ฟิลด์กำหนดเอง

source: Instructions
th: คำแนะนำ

source: 1. Place the following shortcode in the page or post where you want to display the registration form:
th: 1. วาง shortcode ต่อไปนี้ในหน้าหรือโพสต์ที่คุณต้องการแสดงแบบฟอร์มลงทะเบียน:

source: reCAPTCHA Setup
th: ตั้งค่า reCAPTCHA

source: 2. Register and get your reCAPTCHA keys at:
th: 2. ลงทะเบียนและรับคีย์ reCAPTCHA ได้ที่:

source: 3. Choose reCAPTCHA v2 ("I'm not a robot")
th: 3. เลือก reCAPTCHA v2 ("ฉันไม่ใช่โปรแกรมอัตโนมัติ")

source: 4. Add your domain to the reCAPTCHA settings
th: 4. เพิ่มโดเมนของคุณในการตั้งค่า reCAPTCHA

source: 5. Copy Site Key and Secret Key into the fields below
th: 5. คัดลอก Site Key และ Secret Key ลงในฟิลด์ด้านล่าง

source: Features
th: คุณสมบัติ

source: Register new members
th: ลงทะเบียนสมาชิกใหม่

source: Validate data
th: ตรวจสอบข้อมูล

source: Prevent spam with reCAPTCHA
th: ป้องกันสแปมด้วย reCAPTCHA

source: Auto-login after registration
th: เข้าสู่ระบบอัตโนมัติหลังลงทะเบียน

source: First Name *
th: ชื่อ *

source: Last Name *
th: นามสกุล *

source: Username *
th: ชื่อผู้ใช้ *

source: Email *
th: อีเมล *

source: Password *
th: รหัสผ่าน *

source: Register
th: ลงทะเบียน

source: Color Settings
th: ตั้งค่าสี

source: Color Scheme
th: ชุดสี

source: Enable reCAPTCHA
th: เปิดใช้งาน reCAPTCHA

source: Enable spam protection with reCAPTCHA
th: เปิดใช้งานการป้องกันสแปมด้วย reCAPTCHA

source: When enabled, users must verify they are not a robot before registering
th: เมื่อเปิดใช้งาน ผู้ใช้ต้องยืนยันว่าไม่ใช่โปรแกรมอัตโนมัติก่อนลงทะเบียน

source: Choose a pre-made or custom color scheme
th: เลือกชุดสีที่มีให้หรือกำหนดเอง

source: You are already logged in
th: คุณเข้าสู่ระบบอยู่แล้ว

source: Registration successful
th: ลงทะเบียนสำเร็จ

source: Confirm Password *
th: ยืนยันรหัสผ่าน *

source: Passwords do not match
th: รหัสผ่านไม่ตรงกัน

source: Password must be at least 8 characters long
th: รหัสผ่านต้องมีความยาวอย่างน้อย 8 ตัวอักษร

source: Please enter a valid email address
th: กรุณากรอกอีเมลให้ถูกต้อง

source: Back to login
th: กลับไปหน้าเข้าสู่ระบบ

source: ThaiTop Register Form
th: แบบฟอร์มลงทะเบียน ThaiTop

source: Wordpress user registration form with custom fields.
th: แบบฟอร์มลงทะเบียนผู้ใช้ WordPress พร้อมฟิลด์กำหนดเอง

source: reCAPTCHA Site Key
th: คีย์เว็บไซต์ reCAPTCHA

source: Key for displaying reCAPTCHA on the site
th: คีย์สำหรับแสดง reCAPTCHA บนเว็บไซต์

source: reCAPTCHA Secret Key
th: คีย์ลับ reCAPTCHA

source: Secret key for verifying reCAPTCHA
th: คีย์ลับสำหรับตรวจสอบ reCAPTCHA

source: After Login Redirect URL
th: URL สำหรับเปลี่ยนเส้นทางหลังเข้าสู่ระบบ

source: Enter a custom URL to redirect users after successful auto-login.
th: ใส่ URL ที่ต้องการให้ผู้ใช้ไปหลังจากเข้าสู่ระบบอัตโนมัติสำเร็จ

source: Add New Field
th: เพิ่มฟิลด์ใหม่

source: Field Label
th: ป้ายกำกับฟิลด์

source: Field Name
th: ชื่อฟิลด์

source: Field Type
th: ประเภทฟิลด์

source: Text
th: ข้อความ

source: Phone
th: โทรศัพท์

source: Date
th: วันที่

source: Meta Key
th: คีย์เมตา

source: The key that will be used to store this field in user meta
th: คีย์ที่จะใช้เก็บข้อมูลฟิลด์นี้ในเมตาของผู้ใช้

source: Required
th: จำเป็น

source: Add Field
th: เพิ่มฟิลด์

source: Existing Fields
th: ฟิลด์ที่มีอยู่

source: Label
th: ป้ายกำกับ

source: Name
th: ชื่อ

source: Type
th: ประเภท

source: Actions
th: การกระทำ

source: Form Background
th: พื้นหลังฟอร์ม

source: Form Text Color
th: สีข้อความในฟอร์ม

source: Input Background
th: พื้นหลังช่องกรอก

source: Input Text Color
th: สีข้อความในช่องกรอก

source: Input Border
th: เส้นขอบช่องกรอก

source: Input Focus Border
th: เส้นขอบช่องกรอกเมื่อโฟกัส

source: Button Start Color
th: สีเริ่มต้นปุ่ม

source: Button End Color
th: สีสิ้นสุดปุ่ม

source: Button Text Color
th: สีข้อความปุ่ม

source: Label Text Color
th: สีข้อความป้ายกำกับ

source: Delete
th: ลบ

source: No custom fields found.
th: ไม่พบฟิลด์กำหนดเอง

source: Available User Meta Keys
th: คีย์เมตาผู้ใช้ที่มีอยู่

source: These are the existing user meta keys in your WordPress site. You can use these as reference when creating custom fields.
th: นี่คือคีย์เมตาผู้ใช้ที่มีอยู่ในเว็บไซต์ WordPress ของคุณ คุณสามารถใช้เป็นตัวอ้างอิงเมื่อสร้างฟิลด์กำหนดเอง

source: Copy
th: คัดลอก

source: No custom meta keys found.
th: ไม่พบคีย์เมตากำหนดเอง

source: Green (Default)
th: สีเขียว (ค่าเริ่มต้น)

source: Blue
th: สีน้ำเงิน

source: Purple
th: สีม่วง

source: Dark
th: สีเข้ม

source: Custom
th: กำหนดเอง

source: Field "%s" is required.
th: ฟิลด์ "%s" จำเป็นต้องกรอก

source: Field added successfully.
th: เพิ่มฟิลด์สำเร็จ

source: Database error while adding field.
th: เกิดข้อผิดพลาดฐานข้อมูลขณะเพิ่มฟิลด์

source: Custom Registration Fields
th: ฟิลด์ลงทะเบียนกำหนดเอง

source: Action
th: การกระทำ

source: Invalid operation
th: การดำเนินการไม่ถูกต้อง

source: ThaiTop Register Form Error:
th: ข้อผิดพลาดแบบฟอร์มลงทะเบียน ThaiTop:

source: ThaiTop Register Form: CSS file is missing.
th: แบบฟอร์มลงทะเบียน ThaiTop: ไม่พบไฟล์ CSS
